app/Controllers/ProfileController.php

	public function show_all()
    {
        $data['datauser'] = $this->user->findAll();
---
SELECT *
FROM `user`