app/Controllers/TransaksiController.php

INSERT INTO `transaksi` (`username`, `total_harga`, `alamat`, `ongkir`, `status`, `created_by`, `created_date`) VALUES ('roky', '192000', 'jalan hillsgreen', '12000', 0, 'roky', '2023-07-06 20:59:10')
---
			public function buy()
			{
				if($this->request->getPost())
				{
					$data = $this->request->getPost();

					$transaksiModel = new \App\Models\TransaksiModel();
					$transaksiDetailModel = new \App\Models\TransaksiDetailModel();

					$dataForm = [
						'username' => $this->request->getPost('username'),
						'total_harga' => $this->request->getPost('total_harga'),
						'alamat' => $this->request->getPost('alamat'),
						'ongkir' => $this->request->getPost('ongkir'),
						'status' => 0,
						'created_by' => $this->request->getPost('username'),
						'created_date' => date("Y-m-d H:i:s")
					];

					$transaksiModel->insert($dataForm);

INSERT INTO `transaksi_detail` (`id_transaksi`, `id_barang`, `jumlah`, `diskon`, `subtotal_harga`, `created_by`, `created_date`) VALUES (7, '19', 2, 0, 180000, 'roky', '2023-07-06 20:59:10')
---
							'created_date' => date("Y-m-d H:i:s")
						];

						$transaksiDetailModel->insert($dataFormDetail);

SELECT *
FROM `transaksi`
WHERE `username` = 'roky'
SELECT *
FROM `transaksi_detail`
LEFT JOIN `barang` ON `transaksi_detail`.`id_barang` = `barang`.`id`
WHERE `created_by` = 'roky'
---
			public function history()
			{
				$produkModel = new \App\Models\ProdukModel();
				$transaksiModel = new \App\Models\TransaksiModel();
				$transaksiDetailModel = new \App\Models\TransaksiDetailModel();
				$data['datas'] = $transaksiModel->where('username', session()->get('username'))->findAll();
				$data['datasDetail'] = $transaksiDetailModel->join('barang', 'transaksi_detail.id_barang = barang.id', 'left')->where('created_by', session()->get('username'))->findAll();